# Homebrew Bundle
#
# /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
# brew bundle

# Common
brew "git"
brew "curl"
brew "fd"
brew "gnupg2"
brew "ripgrep"
brew "wget"
brew "zsh"

# Desktop
cask "1password"
cask "google-chrome"
cask "spotify"

# Work
cask "docker"
brew "go"
cask "iterm2"
cask "kitty"
brew "neovim"
brew "nodejs"
brew "nvm"
brew "poetry"
brew "pyenv"
brew "rust"
brew "vim"
cask "wezterm"
cask "zed"
tap "d12frosted/emacs-plus"
brew "emacs-plus", args: ["with-native-comp", "without-cocoa"]

# Fonts
tap  "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-menlo-for-powerline"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono"
cask "font-symbols-only-nerd-font"

# keys.pub
tap  "keys-pub/tap"
brew "keys"
