# Homebrew Bundle
#
# /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
# brew bundle

# Common
brew "git"
brew "curl"
brew "fd"
brew "gnupg2"
brew "ripgrep"
brew "wget"
brew "zsh"

# Desktop
cask "1password"
cask "google-chrome"
cask "spotify"

# Work
cask "docker"
brew "go"
cask "iterm2"
brew "nodejs"
brew "nvm"
brew "poetry"
brew "pyenv"
brew "rust"
brew "vim"

# Fonts
tap  "homebrew/cask-fonts"
cask "font-menlo-for-powerline"

# getdbt.com
tap  "dbt-labs/dbt"
brew "dbt"

# keys.pub
tap  "keys-pub/tap"
brew "keys"
